ЗаявкаДеск/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ЗаявкаДеск/src/CommonModules/РаботаСTelegram/Module.bsl
Процедура ОбработатьУведомления() Экспорт
	ЗаписьЖурналаРегистрации("ОбработкаУведомлений", УровеньЖурналаРегистрации.Информация, , , "Регламентное задание запустилось");
	
	ЗапросБД = Новый Запрос;
	ЗапросБД.Текст = "ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка,
	|	Заявка.Заявитель КАК Заявитель,
	|	Заявка.Исполнитель КАК Исполнитель,
	|	Заявка.Номер КАК Номер,
	|	Заявка.ТекущийСтатус КАК ТекущийСтатус
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.УведомлениеОтправлено = ЛОЖЬ";

	Выборка = ЗапросБД.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Попытка

			Если Выборка.Заявитель.Пустая() Тогда
				Продолжить;
			КонецЕсли;

			TelegramID = Выборка.Заявитель.TelegramID;

			Сообщение = "Заявка №" + Выборка.Номер + ": статус — " + Строка(Выборка.ТекущийСтатус);

			Если НЕ Выборка.Исполнитель.Пустая() Тогда
				Сообщение = Сообщение + ". Исполнитель: " + Выборка.Исполнитель.Имя;
			КонецЕсли;

			УспехОтправки = РаботаСTelegram.ОтправитьСообщение(TelegramID, Сообщение);

			Если УспехОтправки Тогда
				ОбъектЗаявки = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектЗаявки.УведомлениеОтправлено = Истина;
				ОбъектЗаявки.Записать();
			КонецЕсли;

		Исключение
			
		КонецПопытки;

	КонецЦикла;
КонецПроцедуры


Функция ОтправитьСообщение(ChatID, ТекстСообщения) Экспорт
	
	Попытка
		Токен = Константы.ТокенTelegramБота.Получить();
		
		Если ПустаяСтрока(Токен) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		
		Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , ЗащищенноеСоединение);		
		Данные = Новый Структура;
		Данные.Вставить("chat_id", ChatID);
		Данные.Вставить("text", ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ТелоЗапроса = ЗаписьJSON.Закрыть();
		
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Content-Type", "application/json; charset=utf-8");

		
		ЗапросHTTP = Новый HTTPЗапрос("/bot" + Токен + "/sendMessage", ЗаголовкиЗапроса);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);

		ОтветHTTP = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
		
		ЗаписьЖурналаРегистрации("ОтправкаTelegram", УровеньЖурналаРегистрации.Информация, , , "Код: " + Строка(ОтветHTTP.КодСостояния) + " Тело: " + ОтветHTTP.ПолучитьТелоКакСтроку());
		
		Возврат ОтветHTTP.КодСостояния = 200;

	Исключение
		ЗаписьЖурналаРегистрации("ОтправкаTelegram", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
		
КонецФункции
